app/controllers/api/feeds_controller.rb

SELECT "feeds".* FROM "feeds" ORDER BY "feeds"."title" ASC LIMIT 25 OFFSET 0
---
  def index
    render :json => Feed.order(title: :asc).page

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1 ORDER BY title ASC LIMIT 2 OFFSET 0  [["feed_id", 36]]
---
  def show
    @feed = Feed.find(params[:id])
    @entries = @feed.latest_entries.page(1)

INSERT INTO "feeds" ("created_at", "title", "updated_at", "url") VALUES ($1, $2, $3, $4) RETURNING "id"
SELECT "feeds".* FROM "feeds" WHERE "feeds"."url" = 'http://lorem-rss.herokuapp.com/feed' LIMIT 1
---
  def create
    feed = Feed.find_or_create_by_url(feed_params[:url])

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 2]]
---
  def destroy
    feed = Feed.find(params[:id])

    feed.destroy!